# GetWallPreferences

## Description
Gets the Wall Preferences. This can be used with the component calls and the Style selectors.

```pascal
FUNCTION GetWallPreferences : HANDLE;
```

```python

def vs.GetWallPreferences():
    return HANDLE
```

## Returns
The Wall Preferences.

## Version
Availability: from Vectorworks 2011
## Category
* Objects - Architectural